<?php

namespace Database\Seeders;
use App\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PermissionSeed extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            "لوحه التحكم",
            'اضافه مستخدم',
            "تعديل مستخدم",
            "تفاصيل المستخدم",
            "حذف مستخدم",
            "كل المستخدمين",
            "حاله المستخدم",
            "ارفاق صوره المستخدم",
            "تحميل اكسل المستخدمين",

            'اضافه حدث',
            "تعديل حدث",
            "تفاصيل الحدث",
            "حذف حدث",
            "كل الاحداث",
            "حاله الحدث",
            "ارفاق صوره الحدث",
            "تحميل اكسل الحدث",

            'اضافه خبر',
            "تعديل خبر",
            "تفاصيل الخبر",
            "حذف خبر",
            "كل الاخبار",
            "حاله الخبر",
            "ارفاق صوره الخبر",
            "تحميل اكسل الخبر",

            'اضافه تغطيه',
            "تعديل تغطيه",
            "تفاصيل التغطيه",
            "حذف تغطيه",
            "كل التغطيات",
            "حاله التغطيه",
            "ارفاق صوره التغطيه",
            "تحميل اكسل التغطيه",

            'تحميل اكسل الانجاز',
            "اضافه انجاز",
            "تعديل انجاز",
            "تفاصيل الانجاز",
            "حذف انجاز",
            "كل الانجازات",
            "حاله الانجاز",
            "ارفاق صوره الانجاز",
            "ارفاق الايكون",
            
            'اضافه احصائيه',
            "تعديل احصائيه",
            "تفاصيل الاحصائيه",
            "حذف احصائيه",
            "كل الإحصائيات",
            "حاله الاحصائيه",
            "ارفاق صوره الاحصائيه",
            "تحميل اكسل الاحصائيه",

            'اضافه بطل',
            "تعديل بطل",
            "تفاصيل البطل",
            "حذف بطل",
            "كل الابطال",
            "حاله البطل",
            "ارفاق صوره البطل",
            "تحميل اكسل البطل",

            'اضافه داعم',
            "تعديل داعم",
            "تفاصيل الداعم",
            "حذف داعم",
            "كل الداعمين",
            "حاله الداعم",
            "ارفاق صوره الداعم",
            "تحميل اكسل الداعم",

            "كل الرسائل",
            "تفاصيل الرساله",
            "تعديل الرساله",
            "حذف الرساله",
            "تغير رؤيه الرساله",
            "تحميل اكسل الرسائل",

            "اعدادات الموقع",
            "تعديل اعدادات الموقع",
            "تغير حاله الموقع",
            "ارفاق اللوجو العلوي للاعدادات",
            "ارفاق اللوجو السفلي للاعدادات",
                        
            'اضافه تقرير',
            "تعديل تقرير",
            "تفاصيل التقرير",
            "حذف تقرير",
            "كل التقارير",
            "حاله التقرير",
            "ارفاق ملف التقرير",
                        
            'اضافه مدير',
            "تعديل مدير",
            "تفاصيل المدير",
            "حذف مدير",
            "كل المديرين",
            "حاله المدير",
            "ارفاق صوره المدير",
            "تحميل اكسل المدير",

            "صفحه عنا",
            "تعديل صفحه عنا",
                              
            "كل التسجيلات الخاصه بالاحداث",
            "تعديل التسجيل",
            "رؤيه التسجيل",
            "حذف التسجيل",
            "تغير حاله رؤيه التسجيل",
            "تحميل اكسل التسجيلات",
                              
            'اضافه صلاحيه',
            "تعديل صلاحيه",
            "تفاصيل الصلاحيه",
            "حذف صلاحيه",
            "كل الصلحيات",
            'تحميل اكسل صلاحيه',
                              
            'اضافه اذون',
            "تعديل اذون",
            "حذف اذون",
            "كل الاوذونات",
            'تحميل اكسل اذون',
         
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission , "guard_name" => "Admin" ]);
        }
    }
}
